kayrozen/knob-radio/firmware/s3_sender/sdkconfig.defaults
# ESP32-S3 sender defaults.

CONFIG_IDF_TARGET="esp32s3"

# --- PSRAM (8 MB on the R8 module; needed by the ADF pipeline in Phase E) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# --- Performance ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
